<a href="https://colab.research.google.com/github/jessamcs/jessamcs_dojo/blob/main/TitanicDS.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
#Titanic Exercise

In [1]:
import pandas as pd
filename2 = '/content/titanic.csv'
df = pd.read_csv (filename2)
df.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [2]:
#What is the percentage of people who survive
df['Survived'].mean()

0.3838383838383838

In [3]:
filter_survived = df['Survived'] == 1

x = df.loc[filter_survived, :]
y = df.loc[~filter_survived, :]


print('Survived:         ', x['Survived'].count() , x['Survived'].count() / (x['Survived'].count()+y['Survived'].count()))
print('Deceased:         ', y['Survived'].count() , y['Survived'].count() / (x['Survived'].count()+y['Survived'].count()))
print('Total Passengers: ', df['Survived'].count())

Survived:          342 0.3838383838383838
Deceased:          549 0.6161616161616161
Total Passengers:  891

In [4]:
# How many of each sex survived?
male_survived = df['Sex'] == 'male'
female_survived = df['Sex'] == 'female'

m = x.loc[male_survived, :]
f = x.loc[female_survived, :]

print('Male Survived:         ', m['Sex'].count())
print('Female Survived:       ', f['Sex'].count())
print('Total Survivor:        ', x['Survived'].count())

Male Survived:          109
Female Survived:        233
Total Survivor:         342

In [5]:
#what percentage of this group survived?
df.groupby(['Sex'])[['Survived']].sum()

        Survived
Sex
female       233
male         109

In [6]:
# what is the average age of those who did survive?
x['Age'].mean()
df.groupby(['Survived']).mean('Age')

          PassengerId    Pclass        Age     SibSp     Parch       Fare
Survived
0          447.016393  2.531876  30.626179  0.553734  0.329690  22.117887
1          444.368421  1.950292  28.343690  0.473684  0.464912  48.395408

In [7]:
# what is the average age of those who didn't survive?
#y['Age'].mean()
#df.groupby(['Survived']).mean('Age')

          PassengerId    Pclass        Age     SibSp     Parch       Fare
Survived
0          447.016393  2.531876  30.626179  0.553734  0.329690  22.117887
1          444.368421  1.950292  28.343690  0.473684  0.464912  48.395408

In [11]:
# Considering only the group of passengers who paid less than $10, what percentage of this group survived?
fare_filter = df['Fare'] < 10
less_10 = df.loc[fare_filter, :]

u = less_10.loc[filter_survived, :]
v = less_10.loc[~filter_survived, :]

print('Total Survivor:               ', x['Survived'].count())
print('Paying less than $10 count:   ', less_10['Survived'].count())
print('Paying less than $10 Survived: ', u['Survived'].count())
print('Survived:                      ', u['Survived'].count() , u['Survived'].count() / (u['Survived'].count()+v['Survived'].count()))
print('Deceased:                     ', v['Survived'].count() , v['Survived'].count() / (u['Survived'].count()+v['Survived'].count()))
print(x['Survived'].mean())

Total Survivor:                342
Paying less than $10 count:    336
Paying less than $10 Survived:  67
Survived:                       67 0.19940476190476192
Deceased:                      269 0.8005952380952381
1.0

In [12]:
#What is the average age of those who did and didn't survive grouped by Sex?
df.groupby(['Survived', 'Sex']).mean('Age')

                 PassengerId    Pclass  ...     Parch       Fare
Survived Sex                            ...
0        female   434.851852  2.851852  ...  1.037037  23.024385
         male     449.121795  2.476496  ...  0.207265  21.960993
1        female   429.699571  1.918455  ...  0.515021  51.938573
         male     475.724771  2.018349  ...  0.357798  40.821484

[4 rows x 6 columns]